<?php

use App\rcu;
use Illuminate\Database\Seeder;

class rcuSeeder extends Seeder
{

    protected $RCU = [
        ['name' => 'Александровский',   'host' => '10.32.5.2', 'rts_id' => '1'],
        ['name' => 'Алешня',            'host' => '10.32.2.2', 'rts_id' => '2'],
        ['name' => 'Байкова',           'host' => '10.32.3.2', 'rts_id' => '3'],
        ['name' => 'Белая Березка',     'host' => '10.32.4.2', 'rts_id' => '4'],
        ['name' => 'Брянск',            'host' => '10.32.1.2', 'rts_id' => '5'],
        ['name' => 'Брянск СРП2+1',     'host' => '10.32.1.20', 'rts_id' => '5'],
        ['name' => 'Веребск',           'host' => '10.32.6.2', 'rts_id' => '6'],
        ['name' => 'Вормино',           'host' => '10.32.7.2', 'rts_id' => '7'],
        ['name' => 'Гордеевка',         'host' => '10.32.8.2', 'rts_id' => '8'],
        ['name' => 'Деснянский',        'host' => '10.32.9.2', 'rts_id' => '9'],
        ['name' => 'Дятьково',          'host' => '10.32.10.2', 'rts_id' => '10'],
        ['name' => 'Жирятино',          'host' => '10.32.11.2', 'rts_id' => '11'],
        ['name' => 'Жуковка',           'host' => '10.32.12.2', 'rts_id' => '12'],
        ['name' => 'Кистер',            'host' => '10.32.13.2', 'rts_id' => '13'],
        ['name' => 'Клетня',            'host' => '10.32.14.2', 'rts_id' => '14'],
        ['name' => 'Климово',           'host' => '10.32.15.2', 'rts_id' => '15'],
        ['name' => 'Кокоревка',         'host' => '10.32.16.2', 'rts_id' => '16'],
        ['name' => 'Красная Гора',      'host' => '10.32.17.2', 'rts_id' => '17'],
        ['name' => 'Красное',           'host' => '10.32.18.2', 'rts_id' => '18'],
        ['name' => 'Навля',             'host' => '10.32.19.2', 'rts_id' => '19'],
        ['name' => 'Новозыбков',        'host' => '10.32.20.2', 'rts_id' => '20'],
        ['name' => 'Новозыбков СРП2+1', 'host' => '10.32.20.3', 'rts_id' => '20'],
        ['name' => 'Ольховка',          'host' => '10.32.21.2', 'rts_id' => '21'],
        ['name' => 'Ольховка СРП2+1',   'host' => '10.32.21.3', 'rts_id' => '21'],
        ['name' => 'Погар',             'host' => '10.32.22.2', 'rts_id' => '22'],
        ['name' => 'Почеп',             'host' => '10.32.23.2', 'rts_id' => '23'],
        ['name' => 'Речица',            'host' => '10.32.24.2', 'rts_id' => '24'],
        ['name' => 'Сельцо',            'host' => '10.32.25.2', 'rts_id' => '25'],
        ['name' => 'Семячки',           'host' => '10.32.26.2', 'rts_id' => '26'],
        ['name' => 'Снопоть',           'host' => '10.32.27.2', 'rts_id' => '27'],
        ['name' => 'Стародуб',          'host' => '10.32.28.2', 'rts_id' => '28'],
        ['name' => 'Унеча',             'host' => '10.32.29.2', 'rts_id' => '29'],
        ['name' => 'Унеча СРП2+1',      'host' => '10.32.29.3', 'rts_id' => '29'],
        ['name' => 'Чуровичи',          'host' => '10.32.30.2', 'rts_id' => '30'],
        ['name' => 'Шведчики',          'host' => '10.32.31.2', 'rts_id' => '31']

    ];

    public function run()
    {
        foreach($this->RCU as $rcu)
        {
            rcu::create([
                'name' => $rcu['name'],
                'host' => $rcu['host'],
                'rts_id' => $rcu['rts_id']
            ]);
        }
    }
}
